tricker-1/mspm0g3507-code/8_ui_dac8/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000




/* Defines for COMP_0 */
#define COMP_0_INST                                                        COMP0
#define COMP_0_INST_INT_IRQN                                      COMP0_INT_IRQn

/* Defines for COMP_0 DACCODE0 */
#define COMP_0_DACCODE0                                                     (77)


/* GPIO configuration for COMP_0 */

#define GPIO_COMP_0_OUT_PORT                                               GPIOA
#define GPIO_COMP_0_OUT_PIN                                        DL_GPIO_PIN_7
#define GPIO_COMP_0_IOMUX_OUT                                    (IOMUX_PINCM14)
#define GPIO_COMP_0_IOMUX_OUT_FUNC                    IOMUX_PINCM14_PF_COMP0_OUT


/* Defines for OPA_0 */
#define OPA_0_INST                                                          OPA0
#define GPIO_OPA_0_OUT_PORT                                                GPIOA
#define GPIO_OPA_0_OUT_PIN                                        DL_GPIO_PIN_22
#define GPIO_OPA_0_IOMUX_OUT                                     (IOMUX_PINCM47)
#define GPIO_OPA_0_IOMUX_OUT_FUNC                   IOMUX_PINCM47_PF_UNCONNECTED



/* Port definition for Pin Group GPIO_OLED */
#define GPIO_OLED_PORT                                                   (GPIOB)

/* Defines for PIN_SCL: GPIOB.3 with pinCMx 16 on package pin 51 */
#define GPIO_OLED_PIN_SCL_PIN                                    (DL_GPIO_PIN_3)
#define GPIO_OLED_PIN_SCL_IOMUX                                  (IOMUX_PINCM16)
/* Defines for PIN_SDA: GPIOB.2 with pinCMx 15 on package pin 50 */
#define GPIO_OLED_PIN_SDA_PIN                                    (DL_GPIO_PIN_2)
#define GPIO_OLED_PIN_SDA_IOMUX                                  (IOMUX_PINCM15)
/* Defines for GPIO_K3: GPIOB.9 with pinCMx 26 on package pin 61 */
#define GPIO_Key_GPIO_K3_PORT                                            (GPIOB)
#define GPIO_Key_GPIO_K3_PIN                                     (DL_GPIO_PIN_9)
#define GPIO_Key_GPIO_K3_IOMUX                                   (IOMUX_PINCM26)
/* Defines for GPIO_K4: GPIOA.27 with pinCMx 60 on package pin 31 */
#define GPIO_Key_GPIO_K4_PORT                                            (GPIOA)
#define GPIO_Key_GPIO_K4_PIN                                    (DL_GPIO_PIN_27)
#define GPIO_Key_GPIO_K4_IOMUX                                   (IOMUX_PINCM60)
/* Defines for GPIO_K1: GPIOA.26 with pinCMx 59 on package pin 30 */
#define GPIO_Key_GPIO_K1_PORT                                            (GPIOA)
#define GPIO_Key_GPIO_K1_PIN                                    (DL_GPIO_PIN_26)
#define GPIO_Key_GPIO_K1_IOMUX                                   (IOMUX_PINCM59)
/* Defines for GPIO_K2: GPIOB.24 with pinCMx 52 on package pin 23 */
#define GPIO_Key_GPIO_K2_PORT                                            (GPIOB)
#define GPIO_Key_GPIO_K2_PIN                                    (DL_GPIO_PIN_24)
#define GPIO_Key_GPIO_K2_IOMUX                                   (IOMUX_PINCM52)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_COMP_0_init(void);
void SYSCFG_DL_OPA_0_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
